playwright/artillery/config/prod.yml
# Artillery Configuration for Production Environment
# ⚠️ WARNING: Use with extreme caution! Only run with explicit approval.
# Target: http://localhost:3005 (local testing)
# 
# Note: URLs should match config/environments.json
# This file is environment-specific, so hardcoded URLs are acceptable here.
# For consistency, ensure these match the prod environment in config/environments.json

config:
  target: "http://localhost:3005"  # Production environment (local testing)
  phases:
    # Conservative load for production
    # Smoke test phase: Quick 5-second test (prod: 3 users)
    - duration: 5
      arrivalRate: 3
      name: "Single user test"
    # Warm-up phase: Very gradual ramp up to 3 users (prod environment)
    - duration: 120
      arrivalRate: 3
      name: "Warm up"
    # Sustained load: Low concurrent users
    - duration: 300
      arrivalRate: 5
      name: "Sustained load"
  processor: "../processors/homepage-processor.js"
  variables:
    baseUrl: "http://localhost:3005"  # Production environment (local testing)
  payload:
    # Can add test data files here if needed

# Default scenario (can be overridden by scenario files)
scenarios:
  - name: "Homepage Load Test"
    weight: 100
    flow:
      - function: "loadHomepage"
      - think: 2