playwright/artillery/config/test.yml
# Artillery Configuration for Test Environment
# Target: http://localhost:3004
# 
# Note: URLs should match config/environments.json
# This file is environment-specific, so hardcoded URLs are acceptable here.
# For consistency, ensure these match the test environment in config/environments.json

config:
  target: "http://localhost:3004"
  phases:
    # Smoke test phase: Quick 10-second test with light load (test: 1 user/sec)
    # Reduced load to avoid overwhelming services during startup
    - duration: 10
      arrivalRate: 1
      name: "Smoke test - light load"
    # Warm-up phase: Gradually ramp up to 4 users (test environment)
    - duration: 60
      arrivalRate: 4
      name: "Warm up"
    # Sustained load: Maintain 10 concurrent users
    - duration: 300
      arrivalRate: 10
      name: "Sustained load"
  processor: "../processors/homepage-processor.js"
  variables:
    baseUrl: "http://localhost:3004"
  payload:
    # Can add test data files here if needed

# Default scenario (can be overridden by scenario files)
scenarios:
  - name: "Homepage Load Test"
    weight: 100
    flow:
      - function: "loadHomepage"
      - think: 2